Examples/groovyBC/pulsedPitzDaily/0.org/heat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{

    upperWall       
    {
        type            fixedValue;
        value uniform 0;
    }

    lowerWall       
    {
        type            fixedValue;
        value uniform 1;
    }

    frontAndBack    
    {
        type            empty;
    }

    ".+"           
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
