Examples/groovyBC/pulsedPitzDaily/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.05;
    };
    pFinal
    {
        solver PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    };
    U
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    k
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    B
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    nuTilda
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    distance
    {
        solver PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    };
    heat
    {
        solver PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    };
    "residualTime.*"
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    scalar
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}
distanceLaplacianPDE
{
    $PISO;
}
heatLaplacianPDE
{
    $PISO;
}

scalarTransportPDE
{
    $PISO;
}

"residualTime.*TransportPDE"
{
    $PISO;
    nNonOrthogonalCorrectors 3;
}

relaxationFactors
{
    "residualTimeRelax.*" 0.7;
}

// ************************************************************************* //
